Revit 2027 API
ElementRecord.GetDesignOptionId Method
 Gets the design option id of the element record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetDesignOptionId()
Public Function GetDesignOptionId As ElementId
public:
ElementId^ GetDesignOptionId()
member GetDesignOptionId : unit -> ElementId
Return Value
ElementId
 The design option id.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace